MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DN512VMC10/mcu.h
#define DAC0_DAT0L                    (*((volatile uint32_t *)0x400CC000))      // DAC Data Low Register
#define DAC0_DATH                     (*((volatile uint32_t *)0x400CC001))      // DAC Data High Register
#define DAC0_DAT1L                    (*((volatile uint32_t *)0x400CC002))      // DAC Data Low Register
#define DAC0_DAT2L                    (*((volatile uint32_t *)0x400CC004))      // DAC Data Low Register
#define DAC0_DAT3L                    (*((volatile uint32_t *)0x400CC006))      // DAC Data Low Register
#define DAC0_DAT4L                    (*((volatile uint32_t *)0x400CC008))      // DAC Data Low Register
#define DAC0_DAT5L                    (*((volatile uint32_t *)0x400CC00A))      // DAC Data Low Register
#define DAC0_DAT6L                    (*((volatile uint32_t *)0x400CC00C))      // DAC Data Low Register
#define DAC0_DAT7L                    (*((volatile uint32_t *)0x400CC00E))      // DAC Data Low Register
#define DAC0_DAT8L                    (*((volatile uint32_t *)0x400CC010))      // DAC Data Low Register
#define DAC0_DAT9L                    (*((volatile uint32_t *)0x400CC012))      // DAC Data Low Register
#define DAC0_DAT10L                   (*((volatile uint32_t *)0x400CC014))      // DAC Data Low Register
#define DAC0_DAT11L                   (*((volatile uint32_t *)0x400CC016))      // DAC Data Low Register
#define DAC0_DAT12L                   (*((volatile uint32_t *)0x400CC018))      // DAC Data Low Register
#define DAC0_DAT13L                   (*((volatile uint32_t *)0x400CC01A))      // DAC Data Low Register
#define DAC0_DAT14L                   (*((volatile uint32_t *)0x400CC01C))      // DAC Data Low Register
#define DAC0_DAT15L                   (*((volatile uint32_t *)0x400CC01E))      // DAC Data Low Register
#define DAC0_SR                       (*((volatile uint32_t *)0x400CC020))      // DAC Status Register
#define DAC0_C0                       (*((volatile uint32_t *)0x400CC021))      // DAC Control Register
#define DAC0_C1                       (*((volatile uint32_t *)0x400CC022))      // DAC Control Register 1
#define DAC0_C2                       (*((volatile uint32_t *)0x400CC023))      // DAC Control Register 2
#define DAC1_DAT0L                    (*((volatile uint32_t *)0x400CD000))      // DAC Data Low Register
#define DAC1_DATH                     (*((volatile uint32_t *)0x400CD001))      // DAC Data High Register
#define DAC1_DAT1L                    (*((volatile uint32_t *)0x400CD002))      // DAC Data Low Register
#define DAC1_DAT2L                    (*((volatile uint32_t *)0x400CD004))      // DAC Data Low Register
#define DAC1_DAT3L                    (*((volatile uint32_t *)0x400CD006))      // DAC Data Low Register
#define DAC1_DAT4L                    (*((volatile uint32_t *)0x400CD008))      // DAC Data Low Register
#define DAC1_DAT5L                    (*((volatile uint32_t *)0x400CD00A))      // DAC Data Low Register
#define DAC1_DAT6L                    (*((volatile uint32_t *)0x400CD00C))      // DAC Data Low Register
#define DAC1_DAT7L                    (*((volatile uint32_t *)0x400CD00E))      // DAC Data Low Register
#define DAC1_DAT8L                    (*((volatile uint32_t *)0x400CD010))      // DAC Data Low Register
#define DAC1_DAT9L                    (*((volatile uint32_t *)0x400CD012))      // DAC Data Low Register
#define DAC1_DAT10L                   (*((volatile uint32_t *)0x400CD014))      // DAC Data Low Register
#define DAC1_DAT11L                   (*((volatile uint32_t *)0x400CD016))      // DAC Data Low Register
#define DAC1_DAT12L                   (*((volatile uint32_t *)0x400CD018))      // DAC Data Low Register
#define DAC1_DAT13L                   (*((volatile uint32_t *)0x400CD01A))      // DAC Data Low Register
#define DAC1_DAT14L                   (*((volatile uint32_t *)0x400CD01C))      // DAC Data Low Register
#define DAC1_DAT15L                   (*((volatile uint32_t *)0x400CD01E))      // DAC Data Low Register
#define DAC1_SR                       (*((volatile uint32_t *)0x400CD020))      // DAC Status Register
#define DAC1_C0                       (*((volatile uint32_t *)0x400CD021))      // DAC Control Register
#define DAC1_C1                       (*((volatile uint32_t *)0x400CD022))      // DAC Control Register 1
#define DAC1_C2                       (*((volatile uint32_t *)0x400CD023))      // DAC Control Register 2


//*****************************************************************************
//
// Voltage Reference (VREFV1) registers
//
//*****************************************************************************

#define VREF_TRM                      (*((volatile uint32_t *)0x40074000))      // VREF Trim Register (VREF_TRM)
#define VREF_SC                       (*((volatile uint32_t *)0x40074001))      // VREF Status and Control Register (VREF_SC)


//*****************************************************************************
//
// Programmable Delay Block (PDB) registers
//
//*****************************************************************************

#define PDB0_SC                       (*((volatile uint32_t *)0x40036000))      // Status and Control Register (PDB0_SC)
#define PDB0_MOD                      (*((volatile uint32_t *)0x40036004))      // Modulus Register (PDB0_MOD)
#define PDB0_CNT                      (*((volatile uint32_t *)0x40036008))      // Counter Register (PDB0_CNT)
#define PDB0_IDLY                     (*((volatile uint32_t *)0x4003600C))      // Interrupt Delay Register (PDB0_IDLY)
#define PDB0_CH0C1                    (*((volatile uint32_t *)0x40036010))      // Channel n Control Register 1 (PDB0_CH0C1)
#define PDB0_CH0S                     (*((volatile uint32_t *)0x40036014))      // Channel n Status Register (PDB0_CH0S)
#define PDB0_CH0DLY0                  (*((volatile uint32_t *)0x40036018))      // Channel n Delay 0 Register (PDB0_CH0DLY0)
#define PDB0_CH0DLY1                  (*((volatile uint32_t *)0x4003601C))      // Channel n Delay 1 Register (PDB0_CH0DLY1)
#define PDB0_CH1C1                    (*((volatile uint32_t *)0x40036038))      // Channel n Control Register 1 (PDB0_CH1C1)
#define PDB0_CH1S                     (*((volatile uint32_t *)0x4003603C))      // Channel n Status Register (PDB0_CH1S)
#define PDB0_CH1DLY0                  (*((volatile uint32_t *)0x40036040))      // Channel n Delay 0 Register (PDB0_CH1DLY0)
#define PDB0_CH1DLY1                  (*((volatile uint32_t *)0x40036044))      // Channel n Delay 1 Register (PDB0_CH1DLY1)
#define PDB0_DACINTC0                 (*((volatile uint32_t *)0x40036150))      // DAC Interval Trigger n Control Register (PDB0_DACINTC0)
#define PDB0_DACINT0                  (*((volatile uint32_t *)0x40036154))      // DAC Interval n Register (PDB0_DACINT0)
#define PDB0_DACINTC1                 (*((volatile uint32_t *)0x40036158))      // DAC Interval Trigger n Control Register (PDB0_DACINTC1)
#define PDB0_DACINT1                  (*((volatile uint32_t *)0x4003615C))      // DAC Interval n Register (PDB0_DACINT1)
#define PDB0_POEN                     (*((volatile uint32_t *)0x40036190))      // Pulse-Out n Enable Register (PDB0_POEN)
#define PDB0_PO0DLY                   (*((volatile uint32_t *)0x40036194))      // Pulse-Out n Delay Register (PDB0_PO0DLY)
#define PDB0_PO1DLY                   (*((volatile uint32_t *)0x40036198))      // Pulse-Out n Delay Register (PDB0_PO1DLY)
#define PDB0_PO2DLY                   (*((volatile uint32_t *)0x4003619C))      // Pulse-Out n Delay Register (PDB0_PO2DLY)


//*****************************************************************************
//
// FlexTimer Module (FTM) registers
//
//*****************************************************************************

#define FTM_SC                        (*((volatile uint32_t *)0x40038000))      // Status And Control
#define FTM_CNT                       (*((volatile uint32_t *)0x40038004))      // Counter
#define FTM_MOD                       (*((volatile uint32_t *)0x40038008))      // Modulo
#define FTM_C0SC                      (*((volatile uint32_t *)0x4003800C))      // Channel (n) Status And Control
#define FTM_C0V                       (*((volatile uint32_t *)0x40038010))      // Channel (n) Value
#define FTM_C1SC                      (*((volatile uint32_t *)0x40038014))      // Channel (n) Status And Control
#define FTM_C1V                       (*((volatile uint32_t *)0x40038018))      // Channel (n) Value
#define FTM_C2SC                      (*((volatile uint32_t *)0x4003801C))      // Channel (n) Status And Control
#define FTM_C2V                       (*((volatile uint32_t *)0x40038020))      // Channel (n) Value
#define FTM_C3SC                      (*((volatile uint32_t *)0x40038024))      // Channel (n) Status And Control
#define FTM_C3V                       (*((volatile uint32_t *)0x40038028))      // Channel (n) Value
#define FTM_C4SC                      (*((volatile uint32_t *)0x4003802C))      // Channel (n) Status And Control
#define FTM_C4V                       (*((volatile uint32_t *)0x40038030))      // Channel (n) Value


//*****************************************************************************
//
// Periodic Interrupt Timer (PIT) registers
//
//*****************************************************************************

#define PIT_MCR                       (*((volatile uint32_t *)0x40037000))      // PIT Module Control Register
#define PIT_LDVAL0                    (*((volatile uint32_t *)0x40037100))      // Timer Load Value Register
#define PIT_CVAL0                     (*((volatile uint32_t *)0x40037104))      // Current Timer Value Register
#define PIT_TCTRL0                    (*((volatile uint32_t *)0x40037108))      // Timer Control Register
#define PIT_TFLG0                     (*((volatile uint32_t *)0x4003710C))      // Timer Flag Register
#define PIT_LDVAL1                    (*((volatile uint32_t *)0x40037110))      // Timer Load Value Register
#define PIT_CVAL1                     (*((volatile uint32_t *)0x40037114))      // Current Timer Value Register
#define PIT_TCTRL1                    (*((volatile uint32_t *)0x40037118))      // Timer Control Register
#define PIT_TFLG1                     (*((volatile uint32_t *)0x4003711C))      // Timer Flag Register
#define PIT_LDVAL2                    (*((volatile uint32_t *)0x40037120))      // Timer Load Value Register
#define PIT_CVAL2                     (*((volatile uint32_t *)0x40037124))      // Current Timer Value Register
#define PIT_TCTRL2                    (*((volatile uint32_t *)0x40037128))      // Timer Control Register
#define PIT_TFLG2                     (*((volatile uint32_t *)0x4003712C))      // Timer Flag Register
#define PIT_LDVAL3                    (*((volatile uint32_t *)0x40037130))      // Timer Load Value Register
#define PIT_CVAL3                     (*((volatile uint32_t *)0x40037134))      // Current Timer Value Register
#define PIT_TCTRL3                    (*((volatile uint32_t *)0x40037138))      // Timer Control Register
#define PIT_TFLG3                     (*((volatile uint32_t *)0x4003713C))      // Timer Flag Register


//*****************************************************************************
//
// Low-Power Timer (LPTMR) registers
//
//*****************************************************************************

#define LPTMR0_CSR                    (*((volatile uint32_t *)0x40040000))      // Low Power Timer Control Status Register (LPTMR0_CSR)
#define LPTMR0_PSR                    (*((volatile uint32_t *)0x40040004))      // Low Power Timer Prescale Register (LPTMR0_PSR)
#define LPTMR0_CMR                    (*((volatile uint32_t *)0x40040008))      // Low Power Timer Compare Register (LPTMR0_CMR)
#define LPTMR0_CNR                    (*((volatile uint32_t *)0x4004000C))      // Low Power Timer Counter Register (LPTMR0_CNR)


//*****************************************************************************
//
// Carrier Modulator Transmitter (CMT) registers
//
//*****************************************************************************

#define CMT_CGH1                      (*((volatile uint32_t *)0x40062000))      // CMT Carrier Generator High Data Register 1
#define CMT_CGL1                      (*((volatile uint32_t *)0x40062001))      // CMT Carrier Generator Low Data Register 1
#define CMT_CGH2                      (*((volatile uint32_t *)0x40062002))      // CMT Carrier Generator High Data Register 2
#define CMT_CGL2                      (*((volatile uint32_t *)0x40062003))      // CMT Carrier Generator Low Data Register 2
#define CMT_OC                        (*((volatile uint32_t *)0x40062004))      // CMT Output Control Register
#define CMT_MSC                       (*((volatile uint32_t *)0x40062005))      // CMT Modulator Status and Control Register
#define CMT_CMD1                      (*((volatile uint32_t *)0x40062006))      // CMT Modulator Data Register Mark High
#define CMT_CMD2                      (*((volatile uint32_t *)0x40062007))      // CMT Modulator Data Register Mark Low
#define CMT_CMD3                      (*((volatile uint32_t *)0x40062008))      // CMT Modulator Data Register Space High
#define CMT_CMD4                      (*((volatile uint32_t *)0x40062009))      // CMT Modulator Data Register Space Low
#define CMT_PPS                       (*((volatile uint32_t *)0x4006200A))      // CMT Primary Prescaler Register
#define CMT_DMA                       (*((volatile uint32_t *)0x4006200B))      // CMT Direct Memory Access Register


//*****************************************************************************
//
// Real Time Clock (RTC) registers
//
//*****************************************************************************

#define RTC_TSR                       (*((volatile uint32_t *)0x4003D000))      // RTC Time Seconds Register
#define RTC_TPR                       (*((volatile uint32_t *)0x4003D004))      // RTC Time Prescaler Register
#define RTC_TAR                       (*((volatile uint32_t *)0x4003D008))      // RTC Time Alarm Register
#define RTC_TCR                       (*((volatile uint32_t *)0x4003D00C))      // RTC Time Compensation Register
#define RTC_CR                        (*((volatile uint32_t *)0x4003D010))      // RTC Control Register
#define RTC_SR                        (*((volatile uint32_t *)0x4003D014))      // RTC Status Register
#define RTC_LR                        (*((volatile uint32_t *)0x4003D018))      // RTC Lock Register
#define RTC_IER                       (*((volatile uint32_t *)0x4003D01C))      // RTC Interrupt Enable Register
#define RTC_WAR                       (*((volatile uint32_t *)0x4003D800))      // RTC Write Access Register
#define RTC_RAR                       (*((volatile uint32_t *)0x4003D804))      // RTC Read Access Register


//*****************************************************************************
//
// CAN (FlexCAN) registers
//
//*****************************************************************************

#define MCR                           (*((volatile uint32_t *)0x40024000))      // Module Configuration Register (CAN0_MCR)
#define CTRL1                         (*((volatile uint32_t *)0x40024004))      // Control 1 register (CAN0_CTRL1)
#define TIMER                         (*((volatile uint32_t *)0x40024008))      // Free Running Timer (CAN0_TIMER)
#define RXMGMASK                      (*((volatile uint32_t *)0x40024010))      // Rx Mailboxes Global Mask Register (CAN0_RXMGMASK)
#define RX14MASK                      (*((volatile uint32_t *)0x40024014))      // Rx 14 Mask register (CAN0_RX14MASK)
#define RX15MASK                      (*((volatile uint32_t *)0x40024018))      // Rx 15 Mask register (CAN0_RX15MASK)
#define ECR                           (*((volatile uint32_t *)0x4002401C))      // Error Counter (CAN0_ECR)
#define ESR1                          (*((volatile uint32_t *)0x40024020))      // Error and Status 1 register (CAN0_ESR1)
#define IMASK2                        (*((volatile uint32_t *)0x40024028))      // Interrupt Masks 2 register (CAN0_IMASK2)
#define IFLAG2                        (*((volatile uint32_t *)0x40024030))      // Interrupt Flags 2 register (CAN0_IFLAG2)
#define CTRL2                         (*((volatile uint32_t *)0x40024034))      // Control 2 register (CAN0_CTRL2)
#define ESR2                          (*((volatile uint32_t *)0x40024038))      // Error and Status 2 register (CAN0_ESR2)
#define CRCR                          (*((volatile uint32_t *)0x40024044))      // CRC Register (CAN0_CRCR)
#define RXFGMASK                      (*((volatile uint32_t *)0x40024048))      // Rx FIFO Global Mask register (CAN0_RXFGMASK)
#define RXFIR                         (*((volatile uint32_t *)0x4002404C))      // Rx FIFO Information Register (CAN0_RXFIR)
#define RXIMR0                        (*((volatile uint32_t *)0x40024880))      // Rx Individual Mask Registers (CAN0_RXIMR0)
#define RXIMR1                        (*((volatile uint32_t *)0x40024884))      // Rx Individual Mask Registers (CAN0_RXIMR1)
#define RXIMR2                        (*((volatile uint32_t *)0x40024888))      // Rx Individual Mask Registers (CAN0_RXIMR2)
#define RXIMR3                        (*((volatile uint32_t *)0x4002488C))      // Rx Individual Mask Registers (CAN0_RXIMR3)
#define RXIMR4                        (*((volatile uint32_t *)0x40024890))      // Rx Individual Mask Registers (CAN0_RXIMR4)
#define RXIMR5                        (*((volatile uint32_t *)0x40024894))      // Rx Individual Mask Registers (CAN0_RXIMR5)
#define RXIMR6                        (*((volatile uint32_t *)0x40024898))      // Rx Individual Mask Registers (CAN0_RXIMR6)
#define RXIMR7                        (*((volatile uint32_t *)0x4002489C))      // Rx Individual Mask Registers (CAN0_RXIMR7)
#define RXIMR8                        (*((volatile uint32_t *)0x400248A0))      // Rx Individual Mask Registers (CAN0_RXIMR8)
#define RXIMR9                        (*((volatile uint32_t *)0x400248A4))      // Rx Individual Mask Registers (CAN0_RXIMR9)
#define RXIMR10                       (*((volatile uint32_t *)0x400248A8))      // Rx Individual Mask Registers (CAN0_RXIMR10)
#define RXIMR11                       (*((volatile uint32_t *)0x400248AC))      // Rx Individual Mask Registers (CAN0_RXIMR11)
#define RXIMR12                       (*((volatile uint32_t *)0x400248B0))      // Rx Individual Mask Registers (CAN0_RXIMR12)
#define RXIMR13                       (*((volatile uint32_t *)0x400248B4))      // Rx Individual Mask Registers (CAN0_RXIMR13)
#define RXIMR14                       (*((volatile uint32_t *)0x400248B8))      // Rx Individual Mask Registers (CAN0_RXIMR14)
#define RXIMR15                       (*((volatile uint32_t *)0x400248BC))      // Rx Individual Mask Registers (CAN0_RXIMR15)
#define MCR                           (*((volatile uint32_t *)0x400A4000))      // Module Configuration Register (CAN1_MCR)
#define CTRL1                         (*((volatile uint32_t *)0x400A4004))      // Control 1 register (CAN1_CTRL1)
#define TIMER                         (*((volatile uint32_t *)0x400A4008))      // Free Running Timer (CAN1_TIMER)
#define RXMGMASK                      (*((volatile uint32_t *)0x400A4010))      // Rx Mailboxes Global Mask Register (CAN1_RXMGMASK)
#define RX14MASK                      (*((volatile uint32_t *)0x400A4014))      // Rx 14 Mask register (CAN1_RX14MASK)
#define RX15MASK                      (*((volatile uint32_t *)0x400A4018))      // Rx 15 Mask register (CAN1_RX15MASK)
#define ECR                           (*((volatile uint32_t *)0x400A401C))      // Error Counter (CAN1_ECR)
#define ESR1                          (*((volatile uint32_t *)0x400A4020))      // Error and Status 1 register (CAN1_ESR1)
#define IMASK2                        (*((volatile uint32_t *)0x400A4028))      // Interrupt Masks 2 register (CAN1_IMASK2)
#define IFLAG2                        (*((volatile uint32_t *)0x400A4030))      // Interrupt Flags 2 register (CAN1_IFLAG2)
#define CTRL2                         (*((volatile uint32_t *)0x400A4034))      // Control 2 register (CAN1_CTRL2)
#define ESR2                          (*((volatile uint32_t *)0x400A4038))      // Error and Status 2 register (CAN1_ESR2)
#define CRCR                          (*((volatile uint32_t *)0x400A4044))      // CRC Register (CAN1_CRCR)
#define RXFGMASK                      (*((volatile uint32_t *)0x400A4048))      // Rx FIFO Global Mask register (CAN1_RXFGMASK)
#define RXFIR                         (*((volatile uint32_t *)0x400A404C))      // Rx FIFO Information Register (CAN1_RXFIR)
#define RXIMR0                        (*((volatile uint32_t *)0x400A4880))      // Rx Individual Mask Registers (CAN1_RXIMR0)
#define RXIMR1                        (*((volatile uint32_t *)0x400A4884))      // Rx Individual Mask Registers (CAN1_RXIMR1)
#define RXIMR2                        (*((volatile uint32_t *)0x400A4888))      // Rx Individual Mask Registers (CAN1_RXIMR2)
#define RXIMR3                        (*((volatile uint32_t *)0x400A488C))      // Rx Individual Mask Registers (CAN1_RXIMR3)
#define RXIMR4                        (*((volatile uint32_t *)0x400A4890))      // Rx Individual Mask Registers (CAN1_RXIMR4)
#define RXIMR5                        (*((volatile uint32_t *)0x400A4894))      // Rx Individual Mask Registers (CAN1_RXIMR5)
#define RXIMR6                        (*((volatile uint32_t *)0x400A4898))      // Rx Individual Mask Registers (CAN1_RXIMR6)
#define RXIMR7                        (*((volatile uint32_t *)0x400A489C))      // Rx Individual Mask Registers (CAN1_RXIMR7)
#define RXIMR8                        (*((volatile uint32_t *)0x400A48A0))      // Rx Individual Mask Registers (CAN1_RXIMR8)
#define RXIMR9                        (*((volatile uint32_t *)0x400A48A4))      // Rx Individual Mask Registers (CAN1_RXIMR9)
#define RXIMR10                       (*((volatile uint32_t *)0x400A48A8))      // Rx Individual Mask Registers (CAN1_RXIMR10)
#define RXIMR11                       (*((volatile uint32_t *)0x400A48AC))      // Rx Individual Mask Registers (CAN1_RXIMR11)
#define RXIMR12                       (*((volatile uint32_t *)0x400A48B0))      // Rx Individual Mask Registers (CAN1_RXIMR12)
#define RXIMR13                       (*((volatile uint32_t *)0x400A48B4))      // Rx Individual Mask Registers (CAN1_RXIMR13)
#define RXIMR14                       (*((volatile uint32_t *)0x400A48B8))      // Rx Individual Mask Registers (CAN1_RXIMR14)
#define RXIMR15                       (*((volatile uint32_t *)0x400A48BC))      // Rx Individual Mask Registers (CAN1_RXIMR15)


//*****************************************************************************
//
// Serial Peripheral Interface (SPI) registers
//
//*****************************************************************************

